[
    {
        "company": "Infosys",
        "position": "Technology Lead",
        "duration": "Nov 2018 – Jun 2025 (6+ years)",
        "description": "Spearheaded the digital transformation initiative, leading a team of 12+ engineers in migrating legacy monolithic applications to microservices architecture. Established coding standards, architectural patterns, and mentored junior developers while ensuring delivery of high-quality enterprise solutions.",
        "achievements": [
            "Led migration of 5+ enterprise applications to microservices, reducing system downtime by 80%",
            "Mentored 12+ engineers and conducted technical training sessions on cloud-native architecture",
            "Established CI/CD pipelines reducing deployment time from 4 hours to 30 minutes",
            "Architected scalable solutions handling 10K+ concurrent users with 99.9% uptime",
            "Improved code quality by implementing automated testing, increasing coverage to 85%"
        ],
        "technologies": [
            "C#",
            ".NET Core",
            "Azure",
            "Docker",
            "Kubernetes",
            "Angular",
            "React",
            "SQL Server",
            "Azure DevOps"
        ]
    },
    {
        "company": "Notetech Software",
        "position": "Senior Dot Net Developer",
        "duration": "Jan 2018 – Oct 2018 (10 months)",
        "description": "Architected cloud-native solutions for enterprise clients, focusing on scalability and performance. Improved CI/CD pipelines and established best practices for API development and deployment.",
        "achievements": [
            "Architected RESTful APIs handling 5K+ requests per second with caching strategies",
            "Implemented OAuth 2.0 authentication improving security compliance",
            "Optimized database queries reducing query execution time by 45%",
            "Collaborated with DevOps team to setup monitoring and logging infrastructure",
            "Developed comprehensive API documentation and developer guidelines"
        ],
        "technologies": [
            "C#",
            ".NET Core",
            "Azure",
            "Angular",
            "JavaScript",
            "Redis",
            "Jenkins"
        ]
    },
    {
        "company": "Zerone Consulting",
        "position": "Software Engineer L3",
        "duration": "Feb 2017 – Sep 2017 (8 months)",
        "description": "Built scalable APIs and robust backend systems for SaaS applications. Introduced agile practices and promoted a culture of continuous improvement across the engineering team.",
        "achievements": [
            "Designed and developed scalable RESTful APIs for 3 enterprise SaaS products",
            "Introduced Git-based workflow and code review processes improving code quality",
            "Implemented automated testing reducing bug escapes to production by 60%",
            "Mentored 4 junior developers on .NET and cloud development best practices",
            "Established Agile/Scrum practices increasing team productivity by 35%"
        ],
        "technologies": [
            "C#",
            ".NET Core",
            "Azure",
            "Angular",
            "JavaScript",
            "Node.js",
            "MongoDB",
            "Git"
        ]
    },
    {
        "company": "Aabasoft Technologies (India) Pvt. Ltd.",
        "position": "Senior Dot Net Developer",
        "duration": "Dec 2014 – Jan 2017 (2+ years)",
        "description": "Developed MVPs and production systems for various clients. Wore multiple hats in development and operations, gaining comprehensive understanding of full software development lifecycle from design to deployment and maintenance.",
        "achievements": [
            "Developed 8+ MVPs for startups and enterprises from concept to launch",
            "Managed deployment and maintenance of production systems serving 50K+ users",
            "Implemented monitoring and alerting systems reducing MTTR by 50%",
            "Trained team members on .NET technologies and best practices",
            "Participated in architectural design reviews for new projects"
        ],
        "technologies": [
            "C#",
            ".NET Framework",
            "ASP.NET MVC",
            "SQL Server",
            "JavaScript",
            "jQuery",
            "IIS"
        ]
    }
]