[
    {
        "company": "Infosys",
        "position": "Technology Lead",
        "duration": "Nov 2018 – Jun 2025 (6+ years)",
        "description": "Spearheaded the digital transformation initiative, leading a team of 12+ engineers in migrating legacy monolithic applications to microservices architecture. Established coding standards, architectural patterns, and mentored junior developers while ensuring delivery of high-quality enterprise solutions.",
        "achievements": [
            "Led migration of 5+ enterprise applications to microservices, reducing system downtime by 80%",
            "Mentored 12+ engineers and conducted technical training sessions",
            "Established workflows reducing deployment time from 4 hours to 30 minutes",
            "Architected scalable solutions",
            "Improved code quality by implementing automated testing, increasing coverage to 95%",
            "Periodic Code reviews and knowledge sharing sessions",
            "Introduced Git-based workflow and code review processes improving code quality",
            "Conducted and participated in technical interviews",
            "Collaborated with cross-functional teams to define project requirements and deliverables",
            "Optimized application performance, resulting in a 40% reduction in response times",
            "Implemented containerization using Docker and Kubernetes, enhancing deployment flexibility",
            "Adopted front-end frameworks like Angular, React and Vue to improve user experience",
            "Conducted regular performance reviews and provided constructive feedback to team members",
            "Managed deployment and maintenance of production systems with high sensitivity on uptime and reliability",
            "Collaborated with DevOps team to setup monitoring and logging infrastructure",
            "Developed comprehensive API documentation and developer guidelines",
            "Stayed updated with emerging technologies and industry trends to drive innovation within the team",
            "Certified in Generative and Prompt Engineering Fundamentals in internal Infosys certification program",
            "Certified in various Microsoft Certifications: Azure Fundamentals (AZ-900), Azure Developer Associate (AZ-204), DP-900: Microsoft Azure Data Fundamentals and SC-900: Microsoft Security, Compliance, and Identity Fundamentals"
        ],
        "technologies": [
            "C#",
            ".NET Core",
            "Docker",
            "Kubernetes",
            "Angular",
            "React",
            "Vue",
            "SQL Server",
            "Oracle DB",
            "Azure",
            "GitHub Actions",
            "GitHub Copilot",
            "Microservices",
            "JIRA",
            "Confluence",
            "Agile Methodologies"
        ]
    },
    {
        "company": "Notetech Software",
        "position": "Senior Dot Net Developer",
        "duration": "Jan 2018 – Oct 2018 (10 months)",
        "description": "Contributed as part of the core team in developing a Pharma Admin portal for a pharmaceutical client. The application helped pharmaceutical companies increase production by tracking and managing inventory, orders, and distribution processes based on the demand for medical supplies across various regions.",
        "achievements": [
            "Participated in requirement analysis and system design discussions with clients",
            "Developed key modules for analytics and reporting functionalities",
            "Optimized database queries reducing query execution time by 45%",
            "Collaborated with DevOps team to setup monitoring and logging infrastructure",
            "Delivered sprint commitments on time with high code quality."
        ],
        "technologies": [
            "C#",
            ".NET Core",
            "Angular",
            "TypeScript",
            "MS SQL Server",
            "WCF"
        ]
    },
    {
        "company": "Zerone Consulting",
        "position": "Software Engineer L3",
        "duration": "Feb 2017 – Sep 2017 (8 months)",
        "description": "Worked as part of an agile team to design and develop scalable web application with intelligent insights for medical industry clients. Focused on building robust backend services and APIs while ensuring seamless integration with front-end components.",
        "achievements": [
            "Designed and developed RESTful APIs for data processing and analysis.",
            "Implemented analytical tool with help of NLP to derive insights from doctor inputs.",
            "Integrated various charts to visualize data effectively.",
            "Created logics for data extraction and transformation using SSIS.",
            "Implemented various repoorts using stored procedures and SSRS for data analysis.",
            "Mentored 4 junior developers on .NET and cloud development best practices",
            "Proactive team collaboration for smooth functioning of project."
        ],
        "technologies": [
            "C#",
            "ASP.NET MVC",
            "Angular",
            "JavaScript",
            "Node.js",
            "Azure DevOps",
            "MS SQL Server",
            "Highcharts",
            "SSRS",
            "SSIS",
            "NLP",
            "Dapper",
            "Kendo UI",
            "Azure Cognitive Services"
        ]
    },
    {
        "company": "Aabasoft Technologies (India) Pvt. Ltd.",
        "position": "Senior Dot Net Developer",
        "duration": "Dec 2014 – Jan 2017 (2+ years)",
        "description": "Developed and deployed various web applications for various clients. Wore multiple hats in development and operations, gaining comprehensive understanding of full software development lifecycle from design to deployment and maintenance.",
        "achievements": [
            "Participated in requirement analysis and system design discussions with clients",
            "Developed and maintained web applications using .NET technologies",
            "Optimized application performance, resulting in a 25% reduction in load times",
            "Developed Custom Build Dynamic CRM solutions with VoIP call integration for internal BPO processes. Currently using 600+ users across various departments and clients.",
            "Managed deployment and maintenance of production systems serving 10K+ users",
            "Implemented custom build logging and monitoring tool to integrate with multiple applications",
            "Trained team members on .NET technologies and best practices",
            "Participated in architectural design reviews for new projects"
        ],
        "technologies": [
            "C#",
            ".NET Framework",
            ".Net Web forms",
            "AngularJS",
            "ASP.NET MVC",
            "SQL Server",
            "JavaScript",
            "jQuery",
            "Payment Gateway Integrations",
            "Telerik UI",
            "IIS"
        ]
    }
]