[
    {
        "title": "OCC (Operational Control Center) Hub",
        "year": "2025",
        "description": "Led a team of 15+ members, including developers, tech leads, and testers, through various stages of the SDLC to develop a secure portal for a telecom client. The portal enables scheduling, tracking, and analyzing technician dispatch processes for installation and repair tasks.",
        "technologies": [
            "C#",
            ".NET Core",
            "GCP",
            "SQL Server",
            "React",
            "Typescript",
            "Docker",
            "Kubernetes"
        ],
        "responsibilities": [
            "Created comprehensive documentation and training materials",
            "Conducted code reviews and implemented reusable frontend components (React).",
            "Managed the team and drove sprint activities to ensure timely, high-quality deliverables.",
            "Architected a microservices-based solution with 15+ independent services.",
            "Designed and implemented GCP infrastructure (Kubernetes, Apigee, SQL Database) and integrated Azure AD.",
            "Mentored 10 developers during the migration process.",
            "Established CI/CD pipelines, reducing deployment time by 70%.",
            "Hands-on pair programming with GitHub Copilot to improve code quality and accelerate delivery."
        ],
        "impact": "Migrated a legacy application and created a hub for multiple applications using micro-frontend and microservice implementations, reducing service latency by 50%."
    },
    {
        "title": "Order Management System (Voice Process)",
        "year": "2022 - 2024",
        "description": "Developed an order management system to support the internal voice-based ordering process for telecom services. The system streamlined order capture, validation, provisioning, and tracking, significantly improving operational efficiency and customer satisfaction.",
        "technologies": [
            ".NET MVC",
            "Vue 3",
            "EF Core",
            "Micro-frontend & Microservices",
            "GitHub Actions",
            "SQL Server",
            "Docker",
            "Oracle Database Integration"
        ],
        "responsibilities": [
            "Designed the end-to-end ordering workflow for telecom services, including order capture, validation, provisioning, and tracking.",
            "Built a responsive, data-driven UI using Vue 3 and Highcharts.",
            "Integrated third-party systems to enable order validation and provisioning.",
            "Optimized query performance, improving dashboard load time by 60%.",
            "Developed a comprehensive testing suite with Jest and Cypress.",
            "Created detailed documentation and training materials for system adoption.",
            "Led cross-team collaboration between data stakeholders and engineering teams to align the system with business requirements."
        ],
        "impact": "Achieved a 45% increase in internal order processing efficiency."
    },
    {
        "title": "Keystone",
        "year": "2019 - 2022",
        "description": "Developed a custom business intelligence dashboard with drill-down functionalities using Vue.js and .NET Core APIs for telecom operations and order management systems. The platform provided real-time insights into key performance indicators, enabling data-driven decision-making and improving operational efficiency.",
        "technologies": [
            "Vue.js",
            ".NET MVC Core",
            "Kubernetes",
            "Docker",
            "MS SQL Server",
            "Element UI",
            "Highcharts",
            "PrimeVue",
            "Node.js",
            "JavaScript",
            "Azure AD"
        ],
        "responsibilities": [
            "Architected infrastructure and developed gamification features to enhance user engagement.",
            "Implemented reusable components and optimized data visualization performance.",
            "Integrated logging and monitoring solutions with Splunk to ensure system reliability.",
            "Reduced manual deployment tasks by 85% through automation and CI/CD pipelines.",
            "Trained team members on new technologies and best practices.",
            "Implemented dashboard customization based on user interests and roles, with widgets offering drill-down capabilities."
        ],
        "impact": "Achieved a 60% reduction in identifying critical business process issues through proactive monitoring and analytics."
    },
    {
        "title": "Warehouse Management System (WMS) - Wholesale",
        "year": "2018 - 2019",
        "description": "Migration project to develop a Warehouse Management System (WMS) for a wholesale distribution client. The system optimized inventory management and order fulfillment, improving warehouse efficiency, reducing errors, and enhancing overall operational performance.",
        "technologies": [
            "ASP.NET MVC",
            "JavaScript",
            "SQL Server",
            "Telerik UI",
            "jQuery"
        ],
        "responsibilities": [
            "Collaborated with an agile team to gather requirements and design system architecture.",
            "Integrated a payment gateway to streamline order processing.",
            "Conducted code reviews and implemented performance optimizations.",
            "Performed process analysis and workflow optimization for warehouse operations.",
            "Developed a comprehensive testing suite with unit and integration tests.",
            "Mentored junior developers in full-stack development."
        ],
        "impact": "Increased order fulfillment speed by 30% and reduced inventory discrepancies by 25%."
    },
    {
        "title": "Pharma Admin",
        "year": "2018",
        "description": "Contributed as part of the core team in developing a Pharma Admin portal for a pharmaceutical client. The application helped pharmaceutical companies increase production by tracking and managing inventory, orders, and distribution processes based on the demand for medical supplies across various regions.",
        "technologies": [
            "ASP.NET MVC",
            "Angular",
            "MS SQL Server",
            "WCF",
            "TypeScript"
        ],
        "responsibilities": [
            "Participated in requirement analysis and system design discussions.",
            "Developed key modules for analytics and reporting functionalities.",
            "Delivered sprint commitments on time with high code quality."
        ],
        "impact": "Enhanced inventory tracking accuracy by 20%, enabling better resource allocation."
    },
    {
        "title": "X-Fly",
        "year": "2017- 2017",
        "description": "Application which helps doctors to express their insights about different deceases and using these inputs they can get analytical output to analyse the current situation",
        "technologies": [
            "Node.js",
            "Angular",
            "ASP.NET MVC",
            "MS SQL Server",
            "Dapper",
            "Kendo UI",
            "JavaScript",
            "SSRS",
            "SSIS",
            "NLP",
            "Highcharts"
        ],
        "responsibilities": [
            "Designed and developed RESTful APIs for data processing and analysis.",
            "Implemented analytical tool with help of NLP to derive insights from doctor inputs.",
            "Integrated various charts to visualize data effectively.",
            "Created logics for data extraction and transformation using SSIS.",
            "Implemented various stored procedures and reports using SSRS for data analysis.",
            "Coordinated with management and members for smooth functioning of project."
        ],
        "impact": "Improved data processing speed by 40%, enabling timely insights for medical professionals."
    }
]
